Revit 2024 API
SolidGeometryOptions Members
The SolidGeometryOptions type exposes the following members.
Constructors
Name | Description
SolidGeometryOptions
 Creates a new SolidOptions class with solid tag settings.
Methods
Name | Description
Dispose
Releases all resources used by the SolidGeometryOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SolidTag
 Optional solid tag for the Solid.
See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace